s4bbschn/rc-simrig-control/esp32-esc-controller/src/main.cpp
/**
 * ESP32 ESC/Servo Controller
 * 
 * Steuert ein RC-Car ESC (Traxxas Drifter etc.) und einen Lenkservo
 * direkt per PWM vom ESP32.
 * 
 * Features:
 * - WiFi Access Point mit Web-UI
 * - WebSocket für Echtzeit-Steuerung
 * - REST API für zukünftige Pi-Integration
 * - ESC Arming-Sequenz (plattformabhängig)
 * - Sicherheits-Timeout (Failsafe auf Neutral)
 */

#include <Arduino.h>
#include <WiFi.h>
#include <ESPAsyncWebServer.h>
#include <AsyncTCP.h>
#include <ArduinoJson.h>
#include <SPIFFS.h>
#include <ESP32Servo.h>
#include <ArduinoOTA.h>
#include <ESPmDNS.h>
#include <Wire.h>
#include <MPU6050.h>

// ============================================================
// Pin-Konfiguration
// ============================================================
#define SERVO_STEERING_PIN  16   // GPIO für Lenkservo
#define SERVO_THROTTLE_PIN  19   // GPIO für ESC (Throttle)
#define LED_STATUS_PIN      2    // Onboard-LED für Status

// IMU (MPU6050 / MPU9250) — I²C
#define IMU_SDA_PIN         21   // Standard I²C SDA
#define IMU_SCL_PIN         22   // Standard I²C SCL
#define IMU_SEND_INTERVAL   10   // IMU-Daten alle 10ms senden (100Hz)

// ============================================================
// PWM-Einstellungen
// ============================================================
#define PWM_FREQUENCY       50   // 50Hz = Standard für RC-Servos/ESCs
#define PWM_RESOLUTION      16   // 16-bit Auflösung

// ============================================================
// ESC-Plattformen
// ============================================================
enum ESCPlatform {
    PLATFORM_TRAXXAS = 0,
    PLATFORM_HOBBYWING,
    PLATFORM_GENERIC,
    PLATFORM_COUNT
};

struct ESCProfile {
    const char* name;
    int neutralPulse;       // Neutral-Position (µs)
    int minPulse;           // Volle Bremse/Rückwärts (µs)
    int maxPulse;           // Vollgas (µs)
    int armingDelay;        // Zeit für Arming in ms
    bool needsBrakeBeforeReverse;  // Traxxas: erst Bremse, dann Rückwärts
    int brakeThreshold;     // Ab welchem negativen Wert wird gebremst (µs unter neutral)
};

// ESC-Profile
const ESCProfile escProfiles[PLATFORM_COUNT] = {
    // Traxxas XL-5 / VXL: Neutral=1500, braucht Brems-Sequenz für Rückwärts
    {"Traxxas", 1500, 1000, 2000, 3000, true, 50},
    // Hobbywing QuicRun: ähnlich, aber ohne Brems-Pflicht
    {"Hobbywing", 1500, 1000, 2000, 2000, false, 0},
    // Generic: Standard-Werte
    {"Generic", 1500, 1000, 2000, 2000, false, 0},
};

// ============================================================
// WiFi-Konfiguration
// ============================================================
// STA-Modus: Versucht sich in dieses bestehende Netzwerk einzuwählen
const char* STA_SSID = "RC-ESC-Controller";   // <-- Hier Handy-Hotspot SSID eintragen
const char* STA_PASS = "rc123456";            // <-- Hier Handy-Hotspot Passwort eintragen
const int   STA_MAX_RETRIES = 15;             // Versuche à 500ms = 7.5 Sek
const char* HOSTNAME = "rc-esc";              // mDNS Hostname (.local)

// AP-Modus: Fallback wenn kein bestehendes Netz gefunden
const char* AP_SSID = "RC-ESC-Controller";
const char* AP_PASS = "rc123456";

// Status
bool wifiIsStation = false;  // true = im bestehenden Netz, false = eigener AP

// ============================================================
// Globale Variablen
// ============================================================
AsyncWebServer server(80);
AsyncWebSocket ws("/ws");

Servo steeringServo;
Servo throttleServo;

ESCPlatform currentPlatform = PLATFORM_TRAXXAS;
bool escArmed = false;
bool armingInProgress = false;

// Aktuelle Werte (-1000 bis +1000, wird auf Pulsweite gemappt)
int currentSteering = 0;    // -1000=links, 0=mitte, +1000=rechts
int currentThrottle = 0;    // -1000=rückwärts/bremse, 0=neutral, +1000=vollgas

// Smoothing: Zielwerte und aktuelle interpolierte Werte
int targetSteering = 0;
int targetThrottle = 0;
float smoothSteering = 0.0f;
float smoothThrottle = 0.0f;
const float STEERING_SMOOTHING = 0.15f;  // 0.0=kein Smooth, 1.0=sofort (je kleiner desto weicher)
const float THROTTLE_SMOOTHING = 0.20f;  // Throttle etwas direkter als Lenkung

// Failsafe
unsigned long lastCommandTime = 0;
const unsigned long FAILSAFE_TIMEOUT = 2000;  // 2 Sekunden ohne Befehl → Neutral

// Traxxas Rückwärts-Logik
enum TraxxasReverseState {
    REVERSE_IDLE,
    REVERSE_BRAKE_SENT,
    REVERSE_NEUTRAL_SENT,
    REVERSE_ACTIVE
};
TraxxasReverseState reverseState = REVERSE_IDLE;
unsigned long reverseStateTime = 0;

// ============================================================
// IMU (MPU6050 / MPU9250)
// ============================================================
MPU6050 mpu;
bool imuAvailable = false;
unsigned long lastImuSend = 0;

// IMU-Rohwerte
float imuYawRate = 0.0f;      // Gierrate (°/s) — Rotation um Hochachse
float imuLateralG = 0.0f;     // Querbeschleunigung (g)
float imuLongitudinalG = 0.0f;// Längsbeschleunigung (g)
float imuPitch = 0.0f;        // Nick (°)
float imuRoll = 0.0f;         // Roll (°)

// Gyro-Kalibrierung (Offset wird beim Start gemessen)
float gyroOffsetZ = 0.0f;
float accelOffsetX = 0.0f;
float accelOffsetY = 0.0f;

// Sensorskalierung MPU6050: ±250°/s = 131 LSB/(°/s), ±2g = 16384 LSB/g
const float GYRO_SCALE = 131.0f;   // für ±250°/s
const float ACCEL_SCALE = 16384.0f; // für ±2g

// ============================================================
// Hilfsfunktionen
// ============================================================

/**
 * Mappt einen Wert (-1000..+1000) auf die Pulsweite für das ESC/Servo
 */
int mapToPulse(int value, int minPulse, int neutralPulse, int maxPulse) {
    if (value == 0) return neutralPulse;
    if (value > 0) {
        return map(value, 0, 1000, neutralPulse, maxPulse);
    } else {
        return map(value, -1000, 0, minPulse, neutralPulse);
    }
}

/**
 * Setzt die Lenkung
 */
void setSteering(int value) {
    value = constrain(value, -1000, 1000);
    currentSteering = value;
    targetSteering = value;
    Serial.printf("[Steering] value=%d pulse=%d\n", value, map(value, -1000, 1000, 1000, 2000));
}

/**
 * Setzt das Throttle (mit Traxxas-Rückwärts-Logik)
 */
void setThrottle(int value) {
    value = constrain(value, -1000, 1000);
    currentThrottle = value;
    targetThrottle = value;
    
    if (!escArmed) return;
    
    const ESCProfile& profile = escProfiles[currentPlatform];

    // Traxxas Rückwärts-Handling
    if (profile.needsBrakeBeforeReverse && value < 0) {
        if (reverseState == REVERSE_IDLE) {
            reverseState = REVERSE_BRAKE_SENT;
            reverseStateTime = millis();
        }
    } else if (value >= 0) {
        reverseState = REVERSE_IDLE;
    }
}

/**
 * ESC Arming-Sequenz
 */
void armESC() {
    if (armingInProgress || escArmed) return;
    
    armingInProgress = true;
    const ESCProfile& profile = escProfiles[currentPlatform];
    
