s4bbschn/rc-simrig-control/esp32-esc-controller/src/main.cpp
    Serial.printf("[ESC] Arming '%s' — sende Neutral (%d µs) für %d ms...\n",
                  profile.name, profile.neutralPulse, profile.armingDelay);
    
    // Neutral-Signal senden
    throttleServo.writeMicroseconds(profile.neutralPulse);
    
    // Nicht-blockierendes Arming (wird im Loop geprüft)
    // Für den ersten Test machen wir es blockierend
    delay(profile.armingDelay);
    
    escArmed = true;
    armingInProgress = false;
    Serial.println("[ESC] Armed!");
    
    // Status an alle WebSocket-Clients senden
    JsonDocument doc;
    doc["type"] = "status";
    doc["armed"] = true;
    doc["platform"] = profile.name;
    String json;
    serializeJson(doc, json);
    ws.textAll(json);
}

/**
 * ESC Disarm
 */
void disarmESC() {
    const ESCProfile& profile = escProfiles[currentPlatform];
    throttleServo.writeMicroseconds(profile.neutralPulse);
    escArmed = false;
    reverseState = REVERSE_IDLE;
    currentThrottle = 0;
    
    Serial.println("[ESC] Disarmed!");
    
    JsonDocument doc;
    doc["type"] = "status";
    doc["armed"] = false;
    doc["platform"] = profile.name;
    String json;
    serializeJson(doc, json);
    ws.textAll(json);
}

// ============================================================
// WebSocket Handler
// ============================================================

void onWebSocketEvent(AsyncWebSocket* server, AsyncWebSocketClient* client,
                      AwsEventType type, void* arg, uint8_t* data, size_t len) {
    switch (type) {
        case WS_EVT_CONNECT:
            Serial.printf("[WS] Client #%u verbunden von %s\n", client->id(),
                          client->remoteIP().toString().c_str());
            {
                // Status senden
                JsonDocument doc;
                doc["type"] = "status";
                doc["armed"] = escArmed;
                doc["platform"] = escProfiles[currentPlatform].name;
                doc["steering"] = currentSteering;
                doc["throttle"] = currentThrottle;
                String json;
                serializeJson(doc, json);
                client->text(json);
            }
            break;
            
        case WS_EVT_DISCONNECT:
            Serial.printf("[WS] Client #%u getrennt\n", client->id());
            break;
            
        case WS_EVT_DATA: {
            AwsFrameInfo* info = (AwsFrameInfo*)arg;
            if (info->final && info->index == 0 && info->len == len && info->opcode == WS_TEXT) {
                data[len] = 0;  // Null-terminate
                
                JsonDocument doc;
                DeserializationError error = deserializeJson(doc, (char*)data);
                if (error) {
                    Serial.printf("[WS] JSON Parse Error: %s\n", error.c_str());
                    return;
                }
                
                const char* cmd = doc["cmd"];
                if (!cmd) return;
                
                lastCommandTime = millis();
                
                if (strcmp(cmd, "steer") == 0) {
                    int value = doc["value"] | 0;
                    setSteering(value);
                }
                else if (strcmp(cmd, "throttle") == 0) {
                    int value = doc["value"] | 0;
                    setThrottle(value);
                }
                else if (strcmp(cmd, "arm") == 0) {
                    armESC();
                }
                else if (strcmp(cmd, "disarm") == 0) {
                    disarmESC();
                }
                else if (strcmp(cmd, "platform") == 0) {
                    int p = doc["value"] | 0;
                    if (p >= 0 && p < PLATFORM_COUNT) {
                        disarmESC();  // Erst disarmen bei Plattformwechsel
                        currentPlatform = (ESCPlatform)p;
                        Serial.printf("[ESC] Plattform gewechselt: %s\n",
                                      escProfiles[currentPlatform].name);
                    }
                }
                
                // Nur bei arm/disarm/platform ein ack senden, NICHT bei steer/throttle
                // (zu viele Antworten überlasten den WS-Buffer)
                if (strcmp(cmd, "arm") == 0 || strcmp(cmd, "disarm") == 0 || strcmp(cmd, "platform") == 0) {
                    JsonDocument resp;
                    resp["type"] = "ack";
                    resp["steering"] = currentSteering;
                    resp["throttle"] = currentThrottle;
                    resp["armed"] = escArmed;
                    String json;
                    serializeJson(resp, json);
                    client->text(json);
                }
            }
            break;
        }
        
        default:
            break;
    }
}

// ============================================================
// REST API (für zukünftige Pi-Integration)
// ============================================================

// Forward declarations
void calibrateIMU();
bool initIMU();
void readIMU();
void sendIMUData();

void setupAPI() {
    // Status abrufen
    server.on("/api/status", HTTP_GET, [](AsyncWebServerRequest* request) {
        JsonDocument doc;
        doc["armed"] = escArmed;
        doc["platform"] = escProfiles[currentPlatform].name;
        doc["platformId"] = (int)currentPlatform;
        doc["steering"] = currentSteering;
        doc["throttle"] = currentThrottle;
        doc["uptime"] = millis() / 1000;
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });
    
    // Steuerbefehl senden (POST)
    server.on("/api/control", HTTP_POST, [](AsyncWebServerRequest* request) {},
        NULL,
        [](AsyncWebServerRequest* request, uint8_t* data, size_t len, size_t index, size_t total) {
            JsonDocument doc;
            DeserializationError error = deserializeJson(doc, (char*)data);
            if (error) {
                request->send(400, "application/json", "{\"error\":\"invalid json\"}");
                return;
            }
            
            lastCommandTime = millis();
            
            if (doc.containsKey("steering")) {
                setSteering(doc["steering"] | 0);
            }
            if (doc.containsKey("throttle")) {
                setThrottle(doc["throttle"] | 0);
            }
            
            JsonDocument resp;
            resp["status"] = "ok";
            resp["steering"] = currentSteering;
            resp["throttle"] = currentThrottle;
            String json;
            serializeJson(resp, json);
            request->send(200, "application/json", json);
        }
    );
    
