s4bbschn/rc-simrig-control/esp32-esc-controller/src/main.cpp
    // Arm/Disarm
    server.on("/api/arm", HTTP_POST, [](AsyncWebServerRequest* request) {
        armESC();
        request->send(200, "application/json", "{\"status\":\"armed\"}");
    });
    
    server.on("/api/disarm", HTTP_POST, [](AsyncWebServerRequest* request) {
        disarmESC();
        request->send(200, "application/json", "{\"status\":\"disarmed\"}");
    });
    
    // Plattform-Liste
    server.on("/api/platforms", HTTP_GET, [](AsyncWebServerRequest* request) {
        JsonDocument doc;
        JsonArray arr = doc.to<JsonArray>();
        for (int i = 0; i < PLATFORM_COUNT; i++) {
            JsonObject obj = arr.add<JsonObject>();
            obj["id"] = i;
            obj["name"] = escProfiles[i].name;
            obj["neutralPulse"] = escProfiles[i].neutralPulse;
            obj["minPulse"] = escProfiles[i].minPulse;
            obj["maxPulse"] = escProfiles[i].maxPulse;
            obj["needsBrakeBeforeReverse"] = escProfiles[i].needsBrakeBeforeReverse;
        }
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });
    
    // Plattform setzen
    server.on("/api/platform", HTTP_POST, [](AsyncWebServerRequest* request) {},
        NULL,
        [](AsyncWebServerRequest* request, uint8_t* data, size_t len, size_t index, size_t total) {
            JsonDocument doc;
            deserializeJson(doc, (char*)data);
            int p = doc["platform"] | -1;
            if (p >= 0 && p < PLATFORM_COUNT) {
                disarmESC();
                currentPlatform = (ESCPlatform)p;
                request->send(200, "application/json", "{\"status\":\"ok\"}");
            } else {
                request->send(400, "application/json", "{\"error\":\"invalid platform\"}");
            }
        }
    );
    
    // IMU Status
    server.on("/api/imu", HTTP_GET, [](AsyncWebServerRequest* request) {
        JsonDocument doc;
        doc["available"] = imuAvailable;
        doc["yaw_rate"] = imuYawRate;
        doc["lateral_g"] = imuLateralG;
        doc["longitudinal_g"] = imuLongitudinalG;
        String json;
        serializeJson(doc, json);
        request->send(200, "application/json", json);
    });
    
    // IMU Kalibrierung
    server.on("/api/imu/calibrate", HTTP_POST, [](AsyncWebServerRequest* request) {
        if (imuAvailable) {
            calibrateIMU();
            request->send(200, "application/json", "{\"status\":\"ok\"}");
        } else {
            request->send(503, "application/json", "{\"error\":\"IMU not available\"}");
        }
    });
}

// ============================================================
// IMU Funktionen
// ============================================================

void calibrateIMU() {
    // Misst den Gyro/Accel-Offset im Ruhezustand (Auto muss stillstehen!)
    Serial.println("[IMU] Kalibrierung... (Auto stillhalten!)");
    
    float sumGz = 0, sumAx = 0, sumAy = 0;
    const int samples = 200;
    
    for (int i = 0; i < samples; i++) {
        int16_t ax, ay, az, gx, gy, gz;
        mpu.getMotion6(&ax, &ay, &az, &gx, &gy, &gz);
        sumGz += gz / GYRO_SCALE;
        sumAx += ax / ACCEL_SCALE;
        sumAy += ay / ACCEL_SCALE;
        delay(5);
    }
    
    gyroOffsetZ = sumGz / samples;
    accelOffsetX = sumAx / samples;
    accelOffsetY = sumAy / samples;
    
    Serial.printf("[IMU] Kalibriert: gyroZ=%.2f, accelX=%.3f, accelY=%.3f\n",
                  gyroOffsetZ, accelOffsetX, accelOffsetY);
}

bool initIMU() {
    Wire.begin(IMU_SDA_PIN, IMU_SCL_PIN);
    Wire.setClock(400000);  // 400kHz I²C
    
    mpu.initialize();
    
    if (!mpu.testConnection()) {
        Serial.println("[IMU] MPU6050 NICHT gefunden! FFB deaktiviert.");
        return false;
    }
    
    Serial.println("[IMU] MPU6050 erkannt");
    
    // Konfiguration: ±250°/s Gyro, ±2g Accel, DLPF 42Hz
    mpu.setFullScaleGyroRange(MPU6050_GYRO_FS_250);
    mpu.setFullScaleAccelRange(MPU6050_ACCEL_FS_2);
    mpu.setDLPFMode(MPU6050_DLPF_BW_42);  // Low-Pass Filter 42Hz
    
    calibrateIMU();
    return true;
}

void readIMU() {
    int16_t ax, ay, az, gx, gy, gz;
    mpu.getMotion6(&ax, &ay, &az, &gx, &gy, &gz);
    
    // Gierrate (Yaw) — Rotation um Z-Achse (Hochachse des Autos)
    imuYawRate = (gz / GYRO_SCALE) - gyroOffsetZ;
    
    // Querbeschleunigung (Y-Achse des Sensors = seitlich am Auto)
    imuLateralG = (ay / ACCEL_SCALE) - accelOffsetY;
    
    // Längsbeschleunigung (X-Achse = vorwärts/rückwärts)
    imuLongitudinalG = (ax / ACCEL_SCALE) - accelOffsetX;
}

void sendIMUData() {
    if (!imuAvailable || ws.count() == 0) return;
    
    // Kompaktes JSON für minimale Latenz
    char json[128];
    snprintf(json, sizeof(json),
        "{\"type\":\"imu\",\"yaw\":%.1f,\"lat\":%.3f,\"lon\":%.3f}",
        imuYawRate, imuLateralG, imuLongitudinalG);
    
    ws.textAll(json);
}

// ============================================================
// Setup
// ============================================================

void setup() {
    Serial.begin(115200);
    Serial.println("\n\n=== ESP32 RC ESC Controller ===");
    
    // LED
    pinMode(LED_STATUS_PIN, OUTPUT);
    digitalWrite(LED_STATUS_PIN, LOW);
    
    // SPIFFS für Web-UI
    if (!SPIFFS.begin(true)) {
        Serial.println("[ERROR] SPIFFS Mount fehlgeschlagen!");
    }
    
    // IMU initialisieren
    imuAvailable = initIMU();
    
    // Servos initialisieren
    ESP32PWM::allocateTimer(0);
    ESP32PWM::allocateTimer(1);
    
    steeringServo.setPeriodHertz(PWM_FREQUENCY);
    throttleServo.setPeriodHertz(PWM_FREQUENCY);
    
    steeringServo.attach(SERVO_STEERING_PIN, 1000, 2000);
    throttleServo.attach(SERVO_THROTTLE_PIN, 1000, 2000);
    
    // Neutral-Position
    steeringServo.writeMicroseconds(1500);
    throttleServo.writeMicroseconds(escProfiles[currentPlatform].neutralPulse);
    
    Serial.printf("[Servo] Steering: GPIO %d\n", SERVO_STEERING_PIN);
    Serial.printf("[Servo] Throttle: GPIO %d\n", SERVO_THROTTLE_PIN);
    
