s4bbschn/rc-simrig-control/esp32-esc-controller/src/main.cpp
    // ============================================================
    // WiFi: Erst versuchen sich in bestehendes Netz einzuwählen,
    // dann Fallback auf eigenen AP
    // ============================================================
    WiFi.setHostname(HOSTNAME);
    WiFi.mode(WIFI_STA);
    WiFi.begin(STA_SSID, STA_PASS);
    
    Serial.printf("[WiFi] Suche Netzwerk '%s'...\n", STA_SSID);
    int retries = 0;
    while (WiFi.status() != WL_CONNECTED && retries < STA_MAX_RETRIES) {
        delay(500);
        Serial.print(".");
        retries++;
    }
    Serial.println();
    
    if (WiFi.status() == WL_CONNECTED) {
        // Erfolgreich im bestehenden Netz
        wifiIsStation = true;
        Serial.printf("[WiFi] Verbunden mit '%s'\n", STA_SSID);
        Serial.printf("[WiFi] IP: %s\n", WiFi.localIP().toString().c_str());
        Serial.printf("[WiFi] Hostname: %s.local\n", HOSTNAME);
    } else {
        // Fallback: Eigenen AP aufmachen
        wifiIsStation = false;
        WiFi.disconnect();
        WiFi.mode(WIFI_AP);
        delay(100);
        
        bool apStarted = WiFi.softAP(AP_SSID, AP_PASS);
        if (apStarted) {
            Serial.printf("[WiFi] AP gestartet: %s (Passwort: %s)\n", AP_SSID, AP_PASS);
            Serial.printf("[WiFi] IP: %s\n", WiFi.softAPIP().toString().c_str());
        } else {
            Serial.println("[ERROR] WiFi AP konnte NICHT gestartet werden!");
            delay(1000);
            WiFi.softAP(AP_SSID, AP_PASS);
            Serial.printf("[WiFi] Retry — IP: %s\n", WiFi.softAPIP().toString().c_str());
        }
    }
    
    // mDNS starten (rc-esc.local)
    if (MDNS.begin(HOSTNAME)) {
        MDNS.addService("http", "tcp", 80);
        MDNS.addService("ws", "tcp", 80);
        Serial.printf("[mDNS] Erreichbar unter: http://%s.local\n", HOSTNAME);
    } else {
        Serial.println("[mDNS] Fehler beim Start");
    }
    
    // WebSocket
    ws.onEvent(onWebSocketEvent);
    server.addHandler(&ws);
    
    // REST API
    setupAPI();
    
    // Web-UI aus SPIFFS servieren
    server.serveStatic("/", SPIFFS, "/").setDefaultFile("index.html");
    
    // Fallback: eingebettete Web-UI wenn kein SPIFFS
    server.on("/", HTTP_GET, [](AsyncWebServerRequest* request) {
        if (!SPIFFS.exists("/index.html")) {
            request->send(200, "text/html", 
                "<html><body><h1>ESP32 ESC Controller</h1>"
                "<p>SPIFFS nicht gefunden. Bitte 'pio run -t uploadfs' ausfuehren.</p>"
                "</body></html>");
        }
    });
    
    server.begin();
    Serial.println("[HTTP] Server gestartet auf Port 80");
    if (wifiIsStation) {
        Serial.println("\n--- Bereit! ESP32 im Netzwerk '" + String(STA_SSID) + "' ---");
        Serial.println("--- Öffne http://" + WiFi.localIP().toString() + " oder http://" + String(HOSTNAME) + ".local ---\n");
    } else {
        Serial.println("\n--- Bereit! Verbinde dich mit WiFi '" + String(AP_SSID) + "' ---");
        Serial.println("--- Dann öffne http://192.168.4.1 ---\n");
    }
    
    // OTA Setup
    ArduinoOTA.setHostname(HOSTNAME);
    ArduinoOTA.setPassword("rc123456");
    ArduinoOTA.onStart([]() {
        // Servos auf Neutral bei OTA-Update
        steeringServo.writeMicroseconds(1500);
        throttleServo.writeMicroseconds(1500);
        escArmed = false;
        String type = (ArduinoOTA.getCommand() == U_FLASH) ? "Firmware" : "Filesystem";
        Serial.println("[OTA] Start: " + type);
    });
    ArduinoOTA.onEnd([]() {
        Serial.println("\n[OTA] Fertig! Neustart...");
    });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        Serial.printf("[OTA] %u%%\r", (progress / (total / 100)));
    });
    ArduinoOTA.onError([](ota_error_t error) {
        Serial.printf("[OTA] Error[%u]: ", error);
        if (error == OTA_AUTH_ERROR) Serial.println("Auth Failed");
        else if (error == OTA_BEGIN_ERROR) Serial.println("Begin Failed");
        else if (error == OTA_CONNECT_ERROR) Serial.println("Connect Failed");
        else if (error == OTA_RECEIVE_ERROR) Serial.println("Receive Failed");
        else if (error == OTA_END_ERROR) Serial.println("End Failed");
    });
    ArduinoOTA.begin();
    Serial.println("[OTA] Bereit (Hostname: rc-esc-controller)");
    
    // ESC Arming NICHT mehr im Setup (blockiert WiFi), sondern verzögert
    // armESC() wird jetzt nach 2s im Loop aufgerufen
    
    digitalWrite(LED_STATUS_PIN, HIGH);
}

// ============================================================
// Loop
// ============================================================

void loop() {
    // OTA Handle
    ArduinoOTA.handle();
    
    // WebSocket Cleanup (max 8 Clients erlauben)
    ws.cleanupClients(8);
    
    // Verzögertes Auto-Arming (2s nach Boot, non-blocking)
    static bool autoArmDone = false;
    if (!autoArmDone && millis() > 2000) {
        autoArmDone = true;
        Serial.println("[ESC] Auto-Arming nach Boot...");
        armESC();
    }
    
    // ============================================================
    // Smoothing: Servo-Werte sanft interpolieren (läuft jeden ms)
    // ============================================================
    static unsigned long lastSmoothUpdate = 0;
    if (millis() - lastSmoothUpdate >= 1) {  // ~1000Hz Update-Rate
        lastSmoothUpdate = millis();
        
        // Exponentielles Smoothing (Lowpass-Filter)
        smoothSteering += (targetSteering - smoothSteering) * STEERING_SMOOTHING;
        smoothThrottle += (targetThrottle - smoothThrottle) * THROTTLE_SMOOTHING;
        
        // Steering Servo updaten
        int steerPulse = map((int)smoothSteering, -1000, 1000, 1000, 2000);
        steeringServo.writeMicroseconds(steerPulse);
        
        // Throttle Servo updaten (nur wenn armed)
        if (escArmed) {
            const ESCProfile& profile = escProfiles[currentPlatform];
            
            // Traxxas Rückwärts State-Machine
            if (profile.needsBrakeBeforeReverse && targetThrottle < 0) {
                if (reverseState == REVERSE_BRAKE_SENT) {
                    int brakePulse = mapToPulse((int)smoothThrottle, profile.minPulse, profile.neutralPulse, profile.maxPulse);
                    throttleServo.writeMicroseconds(brakePulse);
                    if (millis() - reverseStateTime > 100) {
                        throttleServo.writeMicroseconds(profile.neutralPulse);
                        reverseState = REVERSE_NEUTRAL_SENT;
                        reverseStateTime = millis();
                    }
                } else if (reverseState == REVERSE_NEUTRAL_SENT) {
                    throttleServo.writeMicroseconds(profile.neutralPulse);
                    if (millis() - reverseStateTime > 100) {
                        reverseState = REVERSE_ACTIVE;
                    }
                } else if (reverseState == REVERSE_ACTIVE) {
                    int throttlePulse = mapToPulse((int)smoothThrottle, profile.minPulse, profile.neutralPulse, profile.maxPulse);
                    throttleServo.writeMicroseconds(throttlePulse);
                }
            } else {
                int throttlePulse = mapToPulse((int)smoothThrottle, profile.minPulse, profile.neutralPulse, profile.maxPulse);
                throttleServo.writeMicroseconds(throttlePulse);
            }
        }
    }
    
    // Failsafe: wenn keine Befehle kommen → Neutral
    if (escArmed && lastCommandTime > 0 && (millis() - lastCommandTime > FAILSAFE_TIMEOUT)) {
        setThrottle(0);
        setSteering(0);
        lastCommandTime = 0;  // Nur einmal triggern
        Serial.println("[FAILSAFE] Timeout — auf Neutral gesetzt");
        
        JsonDocument doc;
        doc["type"] = "failsafe";
        doc["message"] = "Timeout - Neutral";
        String json;
        serializeJson(doc, json);
        ws.textAll(json);
    }
    
    // Status-LED blinken wenn nicht armed
    static unsigned long lastBlink = 0;
    if (!escArmed && millis() - lastBlink > 500) {
        digitalWrite(LED_STATUS_PIN, !digitalRead(LED_STATUS_PIN));
        lastBlink = millis();
    }
    
    // IMU lesen und streamen (100Hz)
    if (imuAvailable && millis() - lastImuSend >= IMU_SEND_INTERVAL) {
        readIMU();
        sendIMUData();
        lastImuSend = millis();
    }
    
    delay(1);  // CPU entlasten
}
